uhnp/src/Documents/ЗаявкаНаКорректировкуПланов/ЗаявкаНаКорректировкуПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаКорректировкуПланов</name>
  <registerRecords>AccumulationRegister.ОперацииБюджетов</registerRecords>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОбъектыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.ДоговорКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.Организация</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектКонтроля</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерв</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <type>
        <types>DefinedType.ОбъектыПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Свободно</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/ChartsOfCharacteristicTypes/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыБюджетов</name>
  <type>
    <types>CatalogRef.СтатьиДоходовИРасходов</types>
    <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.ГруппыСтатейБюджета</types>
  </type>
  <predefined>
    <items>
      <name>БюджетДвиженияДенежныхСредств</name>
      <description>Бюджет движения денежных средств</description>
      <code>БДДС</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>БюджетДоходовИРасходов</name>
      <description>Бюджет доходов и расходов</description>
      <code>БДР</code>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </items>
    <items>
      <name>БюджетДвиженияРесурсов</name>
      <description>Бюджет закупок</description>
      <code>Ресурсы</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВалютнаяПоУмолчанию</name>
    <type>
      <types>EnumRef.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтролироватьНаправление</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/Documents/ЗаявкаНаКорректировкуПланов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУХ.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ИспользоватьРезервирование = КонтрольЛимитовУХПовтИсп.ПолучитьЗначениеИспользованияРезервирования();
	
	СуммаДокумента = Планы.Итог("Сумма") + ?(ИспользоватьРезервирование, Планы.Итог("СуммаРезерв"), 0);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ДокументОснование = ДанныеЗаполнения;
	ТипИсточника = ТипЗнч(ДанныеЗаполнения); 

	// Документы исключения, заполняются при создании на сервере
	ДокументыИсключения = Новый Массив;
    ДокументыИсключения.Добавить(Тип("ДокументСсылка.ВерсияСоглашенияКоммерческийДоговор"));
	ДокументыИсключения.Добавить(Тип("ДокументСсылка.ВерсияСоглашенияКредит"));
	ДокументыИсключения.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	
	Если Не ДокументыИсключения.Найти(ТипИсточника) = Неопределено Тогда
		
		Если ДокументОснование.Проведен Тогда  	
			ШаблонСообщения = НСтр("ru = 'Для ввода документа ""%1"" следует отменить проведение документа: %2'"); 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
							Метаданные.Документы.ЗаявкаНаКорректировкуПланов, ДокументОснование); 
	
			ВызватьИсключение ТекстСообщения;	
		КонецЕсли;

		Возврат;
	КонецЕсли;    
	
	Если ТипИсточника <> Тип("Структура") Тогда
		Источник = ДанныеЗаполнения;
		ДанныеЗаполнения = Новый Структура;
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Ответственный", Пользователи.ТекущийПользователь());
                                   
	Если Не ДанныеЗаполнения.Свойство("ВидБюджета") Тогда
		Если ЗначениеЗаполнено(ВидБюджета) Тогда
			ДанныеЗаполнения.Вставить("ВидБюджета", ВидБюджета);
		Иначе 
			Если ТипИсточника = Тип("ДокументСсылка.ЗаявкаНаРасход") Тогда
				ДанныеЗаполнения.Вставить("ВидБюджета", ПланыВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов);
			ИначеЕсли ТипИсточника = Тип("ДокументСсылка.Резервирование") Тогда
				ДанныеЗаполнения.Вставить("ВидБюджета", Источник.ВидБюджета);
			Иначе
				ДанныеЗаполнения.Вставить("ВидБюджета", ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
	Если КонтрольЛимитовУХ.ЭтоЗакупочныйДокумент(Источник) Тогда
		ВидБюджета = ПланированиеПотребностей.ИспользуемыеВидыБюджетовЗакупок(Источник.Дата);      
		ДанныеЗаполнения.Вставить("ВидБюджета", ВидБюджета);   
	КонецЕсли;

	ТипыВерсииСоглашений = Метаданные.ОпределяемыеТипы.ВерсияСоглашения.Тип;
	ТипыОбъектовПланирования = Метаданные.Документы.КорректировкаПланов.Реквизиты.ДокументОснование.Тип;
	ТипыДоговоров = Метаданные.ОпределяемыеТипы.Договор.Тип;
	
	Если ТипыДоговоров.СодержитТип(ТипИсточника) 
		И Не ТипИсточника = ТипЗнч(Неопределено) Тогда
		ВерсияСоглашения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ВерсияСоглашения");
		ДанныеЗаполнения.Вставить("ДокументОснование", ВерсияСоглашения);
		Документы.ЗаявкаНаКорректировкуПланов.ЗаполнитьПоДокументуПланирования(ЭтотОбъект, 
														ВерсияСоглашения, ДанныеЗаполнения);
	ИначеЕсли ТипыОбъектовПланирования.СодержитТип(ТипИсточника) Тогда   
		
		Если ЗначениеЗаполнено(Источник) И Источник.Проведен Тогда  	
			ШаблонСообщения = НСтр("ru = 'Для ввода документа ""%1"" следует отменить проведение документа: %2'"); 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
							Метаданные.Документы.ЗаявкаНаКорректировкуПланов, Источник); 
	
			ВызватьИсключение ТекстСообщения;	
		КонецЕсли;

		ДанныеЗаполнения.Вставить("ДокументОснование", Источник);
		Документы.ЗаявкаНаКорректировкуПланов.ЗаполнитьПоДокументуПланирования(ЭтотОбъект, Источник, ДанныеЗаполнения);
	ИначеЕсли ТипыВерсииСоглашений.СодержитТип(ТипИсточника) Тогда
		ДанныеЗаполнения.Вставить("ДокументОснование", Источник.ДоговорКонтрагента);
		Документы.ЗаявкаНаКорректировкуПланов.ЗаполнитьПоДокументуПланирования(ЭтотОбъект, Источник, ДанныеЗаполнения);
	ИначеЕсли ТипИсточника = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		Документы.ЗаявкаНаКорректировкуПланов.ЗаполнитьПоДокументуПланирования(ЭтотОбъект, 
												ДанныеЗаполнения.ДокументОснование, ДанныеЗаполнения);
	ИначеЕсли ДанныеЗаполнения.Свойство("ПланыПоБюджетам") Тогда
		Для Каждого Строка Из ДанныеЗаполнения.ПланыПоБюджетам Цикл
			ПланыНоваяСтрока = Планы.Добавить();
			ПланыНоваяСтрока.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
			ЗаполнитьЗначенияСвойств(ПланыНоваяСтрока, Строка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	МассивНепроверяемыхРеквизитов.Добавить("Планы.Сумма");
	МассивНепроверяемыхРеквизитов.Добавить("Планы.СуммаРезерв");  
	
	Для Каждого СтрокаТаблицы Из Планы Цикл   	
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Сумма) 
			И Не ЗначениеЗаполнено(СтрокаТаблицы.СуммаРезерв) Тогда
			
			ШаблонСообщения = Нстр("ru='Не заполнена одна из колонок ""%1""/""%2"" в строке %3 списка ""%4""'"); 
			ТекстСообщения = СтрШаблон(ШаблонСообщения, "Лимит", "Резерв", СтрокаТаблицы.НомерСтроки, "Планы");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);   
			
		КонецЕсли;      	
		
	КонецЦикла; 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
			
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	МСФОУХ.ПроверитьРучныеКорректировкиДокумента(Ссылка, Отказ);
	
	КонтрольЛимитовУХ.ПроверитьИзменениеУчетнойПолитикиПланированиеЗакупок(ЭтотОбъект, ДокументОснование, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// Инициализация дополнительных свойств для проведения документа	
	ПроведениеСерверУХ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, 
											ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ЗаявкаНаКорректировкуПланов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСерверУХ.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	// Движения по регистра	
	ПланированиеПотребностей.ОтразитьОперацииБюджетов(ДополнительныеСвойства, Движения, Отказ);
	
	ОтправитьНаСогласованиеПриПроведенииДокумента(Отказ);
	
КонецПроцедуры  

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУХ.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);	
	
	МодульУправленияПроцессамиУХ.ОтменитьСогласованиеПриОтменеПроведения(Ссылка); 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь(); 
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьНаСогласованиеПриПроведенииДокумента(Отказ)
	
	Если Отказ Тогда    
		Возврат;
	КонецЕсли;
	
	ТекСостояние = УправлениеПроцессамиСогласованияУХ.ВернутьСтатусОбъекта(Ссылка);
	СостоянияПроведения = Новый Массив;
	СостоянияПроведения.Добавить(Перечисления.СостоянияСогласования.Утверждена);
	СостоянияПроведения.Добавить(Перечисления.СостоянияСогласования.НаУтверждении);
	СостоянияПроведения.Добавить(Перечисления.СостоянияСогласования.Отклонена);
	
	Если СостоянияПроведения.Найти(ТекСостояние) = Неопределено Тогда
		ТекСостояние = Перечисления.СостоянияСогласования.Утверждена;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТекущееСостояниеСогласования", ТекСостояние);
	
	МодульУправленияПроцессамиУХ.ОтправитьНаСогласованиеПриПроведенииДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры  

#КонецОбласти  
                   
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
